Terraform plan for __ibo__
<details>
<summary>Plan: 32 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_dns_managed_zone.private-dns-managed-zone will be created
  + resource "google_dns_managed_zone" "private-dns-managed-zone" {
      + description   = "Private DNS zone for ibo-prod"
      + dns_name      = "commerce.internal."
      + force_destroy = false
      + id            = (known after apply)
      + name          = "ibo-prod-private-dns-managed-zone"
      + name_servers  = (known after apply)
      + project       = (known after apply)
      + visibility    = "private"

      + private_visibility_config {
          + networks {
              + network_url = "https://www.googleapis.com/compute/v1/projects/ibo-prod/global/networks/ibo-prod-network"
            }
        }
    }

  # google_dns_record_set.ibo_redis_a_record will be created
  + resource "google_dns_record_set" "ibo_redis_a_record" {
      + id           = (known after apply)
      + managed_zone = "ibo-prod-private-dns-managed-zone"
      + name         = "ibo.redis.commerce.internal."
      + project      = (known after apply)
      + rrdatas      = [
          + (known after apply),
        ]
      + ttl          = 300
      + type         = "A"
    }

  # google_project_iam_member.handler_service_account_iam[0] will be created
  + resource "google_project_iam_member" "handler_service_account_iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "ibo-prod"
      + role    = "roles/datastore.user"
    }

  # google_project_iam_member.payment_service_account_iam[0] will be created
  + resource "google_project_iam_member" "payment_service_account_iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "ibo-prod"
      + role    = "roles/pubsub.editor"
    }

  # google_project_iam_member.payment_service_account_iam[1] will be created
  + resource "google_project_iam_member" "payment_service_account_iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "ibo-prod"
      + role    = "roles/cloudtasks.enqueuer"
    }

  # google_service_account.handler_service_account will be created
  + resource "google_service_account" "handler_service_account" {
      + account_id   = "***************"
      + disabled     = false
      + display_name = "Service account for handler application"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # google_service_account.payment_service_account will be created
  + resource "google_service_account" "payment_service_account" {
      + account_id   = "***************"
      + disabled     = false
      + display_name = "Service account for payment application"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # google_service_account_iam_member.handler_service_account will be created
  + resource "google_service_account_iam_member" "handler_service_account" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "serviceAccount:ibo-prod.svc.id.goog[handler/handler-service]"
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

  # google_service_account_iam_member.payment_service_account will be created
  + resource "google_service_account_iam_member" "payment_service_account" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "serviceAccount:ibo-prod.svc.id.goog[payment/payment-service]"
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

  # kubernetes_service_account.handler_service_account will be created
  + resource "kubernetes_service_account" "handler_service_account" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + name             = "handler-service"
          + namespace        = "handler"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_service_account.payment_service_account will be created
  + resource "kubernetes_service_account" "payment_service_account" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + name             = "payment-service"
          + namespace        = "payment"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.ibo_redis.google_redis_instance.cache will be created
  + resource "google_redis_instance" "cache" {
      + alternative_location_id  = (known after apply)
      + auth_enabled             = true
      + auth_string              = (sensitive value)
      + authorized_network       = "https://www.googleapis.com/compute/v1/projects/ibo-prod/global/networks/ibo-prod-network"
      + connect_mode             = "DIRECT_PEERING"
      + create_time              = (known after apply)
      + current_location_id      = (known after apply)
      + host                     = (known after apply)
      + id                       = (known after apply)
      + location_id              = (known after apply)
      + memory_size_gb           = 2
      + name                     = "ibo-redis"
      + persistence_iam_identity = (known after apply)
      + port                     = (known after apply)
      + project                  = (known after apply)
      + redis_version            = "REDIS_6_X"
      + region                   = "asia-south1"
      + reserved_ip_range        = "10.100.0.0/24"
      + server_ca_certs          = (known after apply)
      + tier                     = "STANDARD_HA"
      + transit_encryption_mode  = "DISABLED"
    }

  # module.payment_events.google_project_iam_member.token_creator_binding[0] will be created
  + resource "google_project_iam_member" "token_creator_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:service-435415796196@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project = "ibo-prod"
      + role    = "roles/iam.serviceAccountTokenCreator"
    }

  # module.payment_events.google_pubsub_subscription.pull_subscriptions[0] will be created
  + resource "google_pubsub_subscription" "pull_subscriptions" {
      + ack_deadline_seconds       = 10
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "payments-internal-payment-events-subscription"
      + path                       = (known after apply)
      + project                    = "ibo-prod"
      + topic                      = "payment-events"

      + expiration_policy {
          + ttl = (known after apply)
        }
    }

  # module.payment_events.google_pubsub_subscription_iam_member.pull_subscription_binding[0] will be created
  + resource "google_pubsub_subscription_iam_member" "pull_subscription_binding" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + member       = "serviceAccount:service-435415796196@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project      = "ibo-prod"
      + role         = "roles/pubsub.subscriber"
      + subscription = "payments-internal-payment-events-subscription"
    }

  # module.payment_events.google_pubsub_topic.topic[0] will be created
  + resource "google_pubsub_topic" "topic" {
      + id      = (known after apply)
      + name    = "payment-events"
      + project = "ibo-prod"

      + message_storage_policy {
          + allowed_persistence_regions = (known after apply)
        }

      + schema_settings {
          + encoding = (known after apply)
          + schema   = (known after apply)
        }
    }

  # module.payment_events.google_pubsub_topic_iam_member.pull_topic_binding[0] will be created
  + resource "google_pubsub_topic_iam_member" "pull_topic_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:service-435415796196@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project = "ibo-prod"
      + role    = "roles/pubsub.publisher"
      + topic   = "projects/ibo-prod/topics/payment-events"
    }

  # module.payment_ticket_events_push.google_project_iam_member.token_creator_binding[0] will be created
  + resource "google_project_iam_member" "token_creator_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:service-435415796196@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project = "ibo-prod"
      + role    = "roles/iam.serviceAccountTokenCreator"
    }

  # module.payment_ticket_events_push.google_pubsub_subscription.push_subscriptions[0] will be created
  + resource "google_pubsub_subscription" "push_subscriptions" {
      + ack_deadline_seconds       = 10
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "payments-internal-payment-refund-ticket-events-subscription"
      + path                       = (known after apply)
      + project                    = "ibo-prod"
      + topic                      = "payment-refund-ticket-events"

      + expiration_policy {
          + ttl = (known after apply)
        }

      + push_config {
          + push_endpoint = "https://services.ibo.com/payment/v1/payment-refund/ticket-event"
        }
    }

  # module.payment_ticket_events_push.google_pubsub_subscription_iam_member.push_subscription_binding[0] will be created
  + resource "google_pubsub_subscription_iam_member" "push_subscription_binding" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + member       = "serviceAccount:service-435415796196@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project      = "ibo-prod"
      + role         = "roles/pubsub.subscriber"
      + subscription = "payments-internal-payment-refund-ticket-events-subscription"
    }

  # module.payment_ticket_events_push.google_pubsub_topic.topic[0] will be created
  + resource "google_pubsub_topic" "topic" {
      + id      = (known after apply)
      + name    = "payment-refund-ticket-events"
      + project = "ibo-prod"

      + message_storage_policy {
          + allowed_persistence_regions = (known after apply)
        }

      + schema_settings {
          + encoding = (known after apply)
          + schema   = (known after apply)
        }
    }

  # module.payment_ticket_events_push.google_pubsub_topic_iam_member.push_topic_binding[0] will be created
  + resource "google_pubsub_topic_iam_member" "push_topic_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:service-435415796196@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project = "ibo-prod"
      + role    = "roles/pubsub.publisher"
      + topic   = "projects/ibo-prod/topics/payment-refund-ticket-events"
    }

  # module.pubsub.google_project_iam_member.token_creator_binding[0] will be created
  + resource "google_project_iam_member" "token_creator_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:service-435415796196@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project = "ibo-prod"
      + role    = "roles/iam.serviceAccountTokenCreator"
    }

  # module.pubsub.google_pubsub_subscription.push_subscriptions[0] will be created
  + resource "google_pubsub_subscription" "push_subscriptions" {
      + ack_deadline_seconds       = 10
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "inventory-threshold-push"
      + path                       = (known after apply)
      + project                    = "ibo-prod"
      + topic                      = "inventory-threshold-create"

      + dead_letter_policy {
          + dead_letter_topic     = "projects/ibo-prod/topics/invetory-threshold-push-dl-topic"
          + max_delivery_attempts = 5
        }

      + expiration_policy {
          + ttl = (known after apply)
        }

      + push_config {
          + push_endpoint = "https://services.ibo.com/common/v1/resource"
        }

      + retry_policy {
          + maximum_backoff = "600s"
          + minimum_backoff = "300s"
        }
    }

  # module.pubsub.google_pubsub_subscription_iam_member.push_subscription_binding[0] will be created
  + resource "google_pubsub_subscription_iam_member" "push_subscription_binding" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + member       = "serviceAccount:service-435415796196@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project      = "ibo-prod"
      + role         = "roles/pubsub.subscriber"
      + subscription = "inventory-threshold-push"
    }

  # module.pubsub.google_pubsub_topic.topic[0] will be created
  + resource "google_pubsub_topic" "topic" {
      + id      = (known after apply)
      + name    = "inventory-threshold-create"
      + project = "ibo-prod"

      + message_storage_policy {
          + allowed_persistence_regions = (known after apply)
        }

      + schema_settings {
          + encoding = (known after apply)
          + schema   = (known after apply)
        }
    }

  # module.pubsub.google_pubsub_topic_iam_member.push_topic_binding[0] will be created
  + resource "google_pubsub_topic_iam_member" "push_topic_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:service-435415796196@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project = "ibo-prod"
      + role    = "roles/pubsub.publisher"
      + topic   = "projects/ibo-prod/topics/invetory-threshold-push-dl-topic"
    }

  # module.pubsub_push.google_project_iam_member.token_creator_binding[0] will be created
  + resource "google_project_iam_member" "token_creator_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:service-435415796196@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project = "ibo-prod"
      + role    = "roles/iam.serviceAccountTokenCreator"
    }

  # module.pubsub_push.google_pubsub_subscription.pull_subscriptions[0] will be created
  + resource "google_pubsub_subscription" "pull_subscriptions" {
      + ack_deadline_seconds       = 10
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "invetory-threshold-push-dl-error"
      + path                       = (known after apply)
      + project                    = "ibo-prod"
      + topic                      = "invetory-threshold-push-dl-topic"

      + expiration_policy {
          + ttl = (known after apply)
        }
    }

  # module.pubsub_push.google_pubsub_subscription_iam_member.pull_subscription_binding[0] will be created
  + resource "google_pubsub_subscription_iam_member" "pull_subscription_binding" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + member       = "serviceAccount:service-435415796196@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project      = "ibo-prod"
      + role         = "roles/pubsub.subscriber"
      + subscription = "invetory-threshold-push-dl-error"
    }

  # module.pubsub_push.google_pubsub_topic.topic[0] will be created
  + resource "google_pubsub_topic" "topic" {
      + id      = (known after apply)
      + name    = "invetory-threshold-push-dl-topic"
      + project = "ibo-prod"

      + message_storage_policy {
          + allowed_persistence_regions = (known after apply)
        }

      + schema_settings {
          + encoding = (known after apply)
          + schema   = (known after apply)
        }
    }

  # module.pubsub_push.google_pubsub_topic_iam_member.pull_topic_binding[0] will be created
  + resource "google_pubsub_topic_iam_member" "pull_topic_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:service-435415796196@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project = "ibo-prod"
      + role    = "roles/pubsub.publisher"
      + topic   = "projects/ibo-prod/topics/invetory-threshold-push-dl-topic"
    }

Plan: 32 to add, 0 to change, 0 to destroy.
```
</details>

Plan generated in [Terraform #303](https://github.com/ebomart/commerce-infrastructure/actions/runs/1402430825)